#!/bin/bash
#Σχόλια με '#"
# Βρόγχος επανάληψης για όλους τους υποφακέλους

for d in */ ; do

    # Προβολή ονόματος του φακέλου που γίνεται επεξεργασία
	
	echo -e "\e[31m#####################################\e[0m"
	
	# Ενημέρωση για τον φάκελο που επεξεργάζεται
	echo -e "\e[32m-------------------------------------\e[0m"
	echo -e "\e[32mΕΠΕΞΕΡΓΑΣΙΑ ΣΤΟΝ ΦΑΚΕΛΟ : $d\e[0m"
    echo -e "\e[32m-------------------------------------\e[0m"
    cd $d

	# Μετονομασία των *.JPG σε *.jpg
	echo -e "\e[33m-------------------------------------\e[0m"
	echo -e "\e[33mΜΕΤΟΝΟΜΑΣΙΑ ΤΩΝ *.JPG ΣΕ *.jpg\e[0m"
	echo -e "\e[33m-------------------------------------\e[0m"

	# Έλεγχος εαν υπάρχουν αρχεία .JPG αντί για .jpg
	shopt -s nullglob
	jpg_files=( *.JPG )
	if [ ${#jpg_files[@]} -gt 0 ]; then
		for file in "${jpg_files[@]}"; do
			if [ -f "$file" ]; then
				tempname="${file%}.old"
				newname="${file%.JPG}.jpg"
				if [ ! -e "$tempname" ]; then
					mv -- "$file" "$tempname"
					mv -- "$tempname" "$newname"
					echo "To αρχείο $file μετονομάστηκε σε $newname"
				else
					echo "Πρόβλημα: ένα αρχείο με το όνομα $tempname υπάρχει ήδη."
				fi
			fi
		done
	else
		echo "No files with the .JPG extension found."
	fi

	# Βρόγχος για όλες τις εικόνες στον υποφάκελο με εκτέλεση του tesseract για Ελληνική, Aγγλική, Γαλλική και Τουρική γλώσσα, και εξαγωγή σε Alto3 XML
	echo -e "\e[35m---------------------------------------------\e[0m"
	echo -e "\e[35mΕΚΚΙΝΗΣΗ ΟΠΤΙΚΗΣ ΑΝΑΓΝΩΡΙΣΗΣ ΧΑΡΑΚΤΗΡΩΝ - OCR\e[0m"
	echo -e "\e[35m---------------------------------------------\e[0m"
	
	for i in *.jpg; 
		do date; 
		echo -n "Εργασία OCR στο αρχείο : ""$i | "; tesseract "$i" "${i%.*}" -l ell alto; 
		echo ""
	done;
    
	
	
	#έλεγχος εάν υπάρχει αρχείο υδατογραφήματος
	if [ -f ../wm.png ]; then
	echo "-------------------------------------"
	
	# Βρόγχος για όλες τις εικόνες στον υποφάκελο για προσθήκη υδατογραφήματος (αρχείο : wm.png)
    # Το αρχείο πρέπει να είναι έξω από τον υποφάκελο ( προηγούμενο επίπεδο)
	
	echo "-------------------------------------"
	echo -e "\e[36mΕΚΚΙΝΗΣΗ ΠΡΟΣΘΗΚΗΣ ΥΔΑΤΟΓΡΑΦΗΜΑΤΟΣ\e[0m"
	echo "-------------------------------------"
		for i in *.jpg; do
			date
			echo "Εισαγωγή υδατογραφήματος στο αρχείο: $i"
			composite -dissolve 15% -gravity center ../wm.png "$i" "$i"
		done;
	else
		echo "Το αρχείο ../wm.png δεν υπάρχει. Δεν θα εισαχθεί υδατογράφημα"
	fi

	# Δημιουργία φακέλων jpg & xml και μετακίνηση όλων των αρχείων σε αυτούς
	echo "-------------------------------------"
	echo -e "\e[32mΔημιουργία φακέλων\e[0m"
	echo "-------------------------------------"


	mkdir jpg;
	mkdir xml;
	echo " "
	echo "-------------------------------------"
	echo "Μετακίνηση αρχείων"
	echo "-------------------------------------"
	mv *.jpg \jpg;
	mv *.xml \xml; 
    
	# Επιστροφή στο προηγούμενο επίπεδο φακέλων
	echo "-------------------------------------"
	echo "Επιστροφή στο προηγούμενο επίπεδο φακέλων"
	echo "-------------------------------------"
	cd ..
done;